app/controllers/assignments_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = 4 LIMIT 1
---
  def new
    @student = Student.find(params[:student_id])

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = 12 LIMIT 1
---
  def edit
    @assignment = Assignment.find(params[:id])

SELECT "students".* FROM "students" WHERE "students"."id" = 4 LIMIT 1
INSERT INTO "assignments" ("completed", "created_at", "description", "due_date", "status", "student_id", "title", "updated_at") VALUES (NULL, '2025-11-16 07:07:23.149898', 'Page 4: Essay 2', '2025-11-21', NULL, 4, 'English Homework', '2025-11-16 07:07:23.149898') RETURNING "id"
---
  def create
    @student = Student.find(params[:student_id])
    @assignment = @student.assignments.new(assignment_params)

    if @assignment.save

UPDATE "assignments" SET "completed" = FALSE, "title" = 'English Homework', "updated_at" = '2025-11-16 07:25:19.855755' WHERE "assignments"."id" = 27
---
  def update
    @student = @assignment.student  # ensure @student is available

    respond_to do |format|
      if @assignment.update(assignment_params)

DELETE FROM "assignments" WHERE "assignments"."id" = 13
---
  def destroy
    @assignment.destroy!

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = 27 LIMIT 1
UPDATE "assignments" SET "completed" = FALSE, "updated_at" = '2025-11-16 07:36:46.005769' WHERE "assignments"."id" = 27
---
  def toggle_complete
    @assignment = Assignment.find(params[:id])
    @student = @assignment.student
    @assignment.update(completed: !@assignment.completed)