app/controllers/assignments_controller.rb

  def destroy
    @assignment.destroy!
---
DELETE FROM "assignments" WHERE "assignments"."id" = 7