app/controllers/students_controller.rb

  def show
    @student = Student.find(params[:id])
    @assignments = @student.assignments.order(:due_date)
---
SELECT "students".* FROM "students" WHERE "students"."id" = 1 LIMIT 1
SELECT "assignments".* FROM "assignments" WHERE "assignments"."student_id" = 1 ORDER BY "assignments"."due_date" ASC

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("created_at", "email", "name", "updated_at") VALUES ('2025-11-16 05:36:11.221265', 'Athelly', 'Coraline', '2025-11-16 05:36:11.221265') RETURNING "id"

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "email" = 'a.coraline@example.com', "name" = 'Coraline Athelly', "updated_at" = '2025-11-16 06:13:48.597697' WHERE "students"."id" = 7

    def set_student
      @student = Student.find(params.expect(:id))
---
SELECT "students".* FROM "students" WHERE "students"."id" = 1 LIMIT 1